aprendizaje/angular_casts/app/controllers/screencasts_controller.rb

SELECT "screencasts".* FROM "screencasts"
---
  def index
    render json: Screencast.all

SELECT "screencasts".* FROM "screencasts" WHERE "screencasts"."id" = ? LIMIT 1  [["id", "980496669"]]
---
  def show
    render json: Screencast.find(params[:id])